"+ Add" = "+ Προσθήκη";

"Add a card" = "Προσθήκη μιας κάρτας";

"Add a payment method" = "Προσθέστε μια μέθοδο πληρωμής";

"Add bank account" = "Προσθήκη τραπεζικού λογαριασμού";

"Add new payment method" = "Προσθέστε νέα μέθοδο πληρωμής";

"Add your payment information" = "Προσθέστε τα στοιχεία πληρωμής σας";

"Approve payment" = "Έγκριση πληρωμής";

"Back" = "Πίσω";

"Bank account" = "Τραπεζικός λογαριασμός";

"Buy now or pay later with Klarna." = "Αγορά τώρα ή πληρωμή αργότερα με Klarna.";

"Buy using a UPI ID" = "Αγορά με χρήση αναγνωριστικού UPI";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Με την επιβεβαίωση της πληρωμής σας μέσω PayPal, επιτρέπετε στην %@ να χρεώσει τον λογαριασμό σας PayPal για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Εάν συνεχίσετε στο PayPal, επιτρέπετε στην %@ να χρεώσει τον λογαριασμό σας PayPal για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Αν συνεχίσετε στο Revolut Pay, επιτρέπετε στην %@ να χρεώνει τον λογαριασμό σας Revolut Pay για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Εάν συνεχίσετε, συμφωνείτε να εξουσιοδοτείτε πληρωμές με βάση <terms>αυτούς τους όρους</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Συνεχίζοντας, εξουσιοδοτείτε την %1$@ να χρεώσει τον λογαριασμό σας Cash App για αυτήν την πληρωμή και μελλοντικές πληρωμές σύμφωνα με τους όρους της %2$@, μέχρι να ανακληθεί αυτή η εξουσιοδότηση. Μπορείτε να αλλάξετε αυτήν την επιλογή οποιαδήποτε στιγμή στις ρυθμίσεις Cash App.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Με την εγγραφή σας στο Link, συμφωνείτε με τους <terms>Όρους</terms> και την <privacy>Πολιτική απορρήτου</privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Με την παροχή των στοιχείων πληρωμής σας και επιβεβαιώνοντας αυτήν την πληρωμή, εξουσιοδοτείτε (A) την %@ και την Stripe, τον πάροχο υπηρεσιών πληρωμών μας, να στείλουν οδηγίες στην τράπεζά σας προκειμένου να χρεώσει τον λογαριασμό σας και (B) την τράπεζά σας προκειμένου να χρεώσει τον λογαριασμό σας, σύμφωνα με τις οδηγίες αυτές. Στο πλαίσιο των δικαιωμάτων σας, δικαιούστε επιστροφή από την τράπεζά σας με βάση τους όρους και τις προϋποθέσεις που διατυπώνονται στη σύμβαση με την τράπεζά σας. Η αξίωση για επιστροφή πρέπει να υποβληθεί εντός 8 εβδομάδων από την ημερομηνία χρέωσης του λογαριασμού σας. Τα δικαιώματά σας επεξηγούνται σε αναλυτική κατάσταση, την οποία μπορείτε να εξασφαλίσετε από την τράπεζά σας. Συμφωνείτε να λαμβάνετε ειδοποιήσεις για μελλοντικές χρεώσεις έως και 2 ημέρες προτού προκύψουν.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Αποθηκεύοντας τον τραπεζικό λογαριασμό σας για την %@, συμφωνείτε να εξουσιοδοτείτε πληρωμές σύμφωνα με <terms>αυτούς τους όρους</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Ακύρωση και πληρωμή με άλλον τρόπο";

"Choose a payment method" = "Επιλέξτε μέθοδο πληρωμής";

"Close card scanner" = "Κλείσιμο σαρωτή κάρτας";

"Confirm" = "Επιβεβαίωση";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Επιβεβαιώστε την πληρωμή στην εφαρμογή τράπεζας ή πληρωμής σας μέσα σε %@ για να ολοκληρώσετε την αγορά.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Επιβεβαιώστε την πληρωμή στην εφαρμογή της τράπεζάς σας μέσα σε %@ για την ολοκλήρωση της αγοράς.";

"Contact information" = "Στοιχεία επικοινωνίας";

"EPS Bank" = "Τράπεζα με EPS";

"Enter address manually" = "Πληκτρολογήστε τη διεύθυνση";

"FPX Bank" = "FPX Bank";

"IBAN" = "IBAN";

"Manage your payment methods" = "Διαχειριστείτε τις μεθόδους πληρωμής σας";

"Name on card" = "Όνομα στην κάρτα";

"Open your UPI app to approve your payment within %@" = "Ανοίξτε την εφαρμογή UPI για να εγκρίνετε την πληρωμή σας σε %@";

"Or" = "Ή";

"Or pay using" = "Ή πληρωμή χρησιμοποιώντας";

"Or pay with a card" = "Ή πληρωμή με κάρτα";

"Pay %@" = "Πληρωμή %@";

"Pay another way" = "Πληρωμή με άλλον τρόπο";

"Pay faster at %@ and thousands of merchants." = "Ταχύτερες πληρωμές στην %@ και σε χιλιάδες εμπόρους.";

"Pay in <num_installments/> interest-free payments of <installment_price/> with <img/>" = "Πληρώστε σε <num_installments/> άτοκες δόσεις των <installment_price/> με <img/>";

"Pay later with Klarna." = "Πληρωμή αργότερα με Klarna.";

"Pay over time with %@" = "Πληρωμή σταδιακά με %@";

"Pay with Link" = "Πληρωμή με το Link";

"Pay with your bank account in just a few steps." = "Πληρώστε με τον τραπεζικό λογαριασμό σας με λίγα μόνο βήματα.";

"Payment failed" = "Η πληρωμή απέτυχε";

"Please go back and select another payment method" = "Πηγαίνετε πίσω και επιλέξτε μια άλλη μέθοδο πληρωμής";

"Point the camera at your card." = "Στρέψτε την κάμερα στην κάρτα σας.";

"Processing..." = "Επεξεργασία…";

"Przelewy24 Bank" = "Τράπεζα Przelewy24";

"Remove %1$@ ending in %2$@" = "Αφαίρεση %1$@ που λήγει σε %2$@";

"Remove Card" = "Αφαίρεση κάρτας";

"Save" = "Αποθήκευση";

"Save a new payment method" = "Αποθήκευση νέας μεθόδου πληρωμής";

"Save address" = "Αποθήκευση διεύθυνσης";

"Save for future payments" = "Αποθήκευση για μελλοντικές πληρωμές";

"Save my info for secure 1-click checkout" = "Αποθήκευση των στοιχείων μου για ασφαλή ολοκλήρωση αγοράς με 1 κλικ";

"Save this account for future %@ payments" = "Αποθηκεύστε αυτόν τον λογαριασμό για μελλοντικές %@ πληρωμές";

"Save this card for future %@ payments" = "Αποθηκεύστε αυτή την κάρτα για μελλοντικές %@ πληρωμές";

"Save your bank account in just a few steps." = "Αποθηκεύστε τον τραπεζικό λογαριασμό σας με λίγα μόνο βήματα.";

"Select your payment method" = "Επιλέξτε τη μέθοδο πληρωμής σας";

"Set up" = "Διαμόρφωση";

"Shipping to %@ is not supported." = "Η αποστολή στη χώρα %@ δεν υποστηρίζεται.";

"Show menu" = "Εμφάνιση μενού";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Η Stripe θα καταθέσει 0,01 $ στον λογαριασμό σας σε 1-2 εργάσιμες ημέρες. Στη συνέχεια, θα λάβετε email με οδηγίες για να ολοκληρώσετε την αποθήκευση του τραπεζικού λογαριασμού σας με την %@.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Η Stripe θα καταθέσει 0,01 $ στον λογαριασμό σας σε 1-2 εργάσιμες ημέρες. Στη συνέχεια, θα λάβετε email με οδηγίες για να ολοκληρώσετε την πληρωμή στην %@.";

"The IBAN you entered is incomplete." = "Ο κωδικός IBAN που εισαγάγατε είναι ελλιπής.";

"Update card" = "Ενημέρωση κάρτας";

"Your IBAN should start with a two-letter country code." = "Ο κωδικός IBAN σας πρέπει να αρχίζει με έναν διψήφιο κωδικό χώρας.";

"iDEAL Bank" = "iDEAL Bank";
